---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.RoomNotUpperBoundedByElement
source: html/7eb6d076-5860-ad25-55fb-a837d5729d7f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.RoomNotUpperBoundedByElement Property

[Family] is not upper bounded by a roof, ceiling or floor element. This can result in incorrect adjacencies and voids in the analytical model. Please ensure that Upper Limit and Limit Offset for [Room] is set correctly.

## Syntax (C#)
```csharp
public static FailureDefinitionId RoomNotUpperBoundedByElement { get; }
```